arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/flexcan/fsl_flexcan_driver.c
    /* Disable FlexCAN interrupts.*/
    INT_SYS_DisableIRQ(g_flexcanWakeUpIrqId[instance]);
    INT_SYS_DisableIRQ(g_flexcanErrorIrqId[instance]);
    INT_SYS_DisableIRQ(g_flexcanBusOffIrqId[instance]);
    INT_SYS_DisableIRQ(g_flexcanOredMessageBufferIrqId[instance]);

    /* Disable FlexCAN.*/
    FLEXCAN_HAL_Disable(g_flexcanBase[instance]);

    /* Disable clock gate to FlexCAN module */
    /* CLOCK_SYS_DisableFlexcanClock(instance);*/
    return 0;
}
/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_DRV_IRQHandler
 * Description   : Interrupt handler for FLEXCAN.
 * This handler read data from MB or FIFO, and then clear the interrupt flags.
 * This is not a public API as it is called whenever an interrupt occurs.
 *
 *END**************************************************************************/

#define X_FSL_CANCOM1       ( 0 )

flexcan_status_t FLEXCAN_UpdateMailBoxMask(
    uint8_t instance,
    uint32_t msgBuffIdx,
    uint32_t stdMask)
{
  CAN_Type * base = g_flexcanBase[instance];
  return FLEXCAN_HAL_SetRxIndividualStdMask(base, msgBuffIdx, stdMask);
}

void FLEXCAN_DRV_IRQHandler(uint8_t instance)
{
    volatile uint32_t flag_reg;
    uint32_t temp;
    CAN_Type * base = g_flexcanBase[instance];
    flexcan_state_t * state = g_flexcanStatePtr[instance];
    
    /* Get the interrupts that are enabled and ready */
    flag_reg = (((FLEXCAN_HAL_GetAllMsgBuffIntStatusFlag(base)) & \
                                    CAN_IMASK1_BUF31TO0M_MASK) & (base->IMASK1));

    /* Check Tx/Rx interrupt flag and clear the interrupt */
    if(flag_reg)
    {
        if ((flag_reg & 0x20) && (BITBAND_ACCESS32(&(base->MCR), CAN_MCR_RFEN_SHIFT)))
        {
            if (state->fifo_message != NULL)
            {
                /* Get RX FIFO field values */
                FLEXCAN_HAL_ReadRxFifo(base, state->fifo_message);
                /* Complete receive data */
                FLEXCAN_DRV_CompleteRxMessageFifoData(instance);
                FLEXCAN_HAL_ClearMsgBuffIntStatusFlag(base, flag_reg);
            }
        }
        else
        {
          /* Check mailbox completed reception */
            temp = (1 << state->rx_mb_idx);
            if ((temp & flag_reg) && state->isRxBusy)
            {
                /* Unlock RX message buffer and RX FIFO*/
                FLEXCAN_HAL_LockRxMsgBuff(base, state->rx_mb_idx);
                /* Get RX MB field values Arvind -> changed to get dlc also*/
                /* commented by Arvind*/
                FLEXCAN_HAL_GetMailBox(base, state->rx_mb_idx, \
                                    state->mb_message, &mailBox_Buffer);
                //FLEXCAN_HAL_GetMsgBuff(base, state->rx_mb_idx, state->mb_message);
                /* Unlock RX message buffer and RX FIFO*/
                FLEXCAN_HAL_UnlockRxMsgBuff(base);

                /* Complete receive data */
                FLEXCAN_DRV_CompleteRxMessageBufferData(instance);
                FLEXCAN_HAL_ClearMsgBuffIntStatusFlag(base, temp & flag_reg);
                
                /* Define receive buffer */
                flexcan_msgbuff_t recvBuff;
                recvBuff.cs = 0;
                recvBuff.msgId = mailBox_Buffer.mb_msgId;

                /* Start receiving data in MB 1. */
                FLEXCAN_DRV_RxMessageBuffer(X_FSL_CANCOM1, state->rx_mb_idx, &recvBuff);
                   
                 /* addded by Arvind*/
                CallBack_fun.pEntry = CAN_RX_EventHandler;
                CallBack_fun.pValue = &mailBox_Buffer;
                
                /* Commented by Arvind*/
                /* Call function Rx/Tx Event handler */
                CallBack_fun.pEntry(CallBack_fun.pValue);  
            }
            
            /* Check mailbox completed transmission */
            temp = (1 << state->tx_mb_idx);
            if ((temp & flag_reg) && state->isTxBusy)
            {
                /* Complete transmit data */
                FLEXCAN_DRV_CompleteSendData(instance);
                FLEXCAN_HAL_ClearMsgBuffIntStatusFlag(base, temp & flag_reg);

                /* Unlock RX message buffer and RX FIFO*/
                FLEXCAN_HAL_LockRxMsgBuff(base, state->tx_mb_idx);
                
                /* Get RX MB field values Arvind -> changed to get dlc also*/
                FLEXCAN_HAL_GetMailBox(base, state->tx_mb_idx, \
                                        state->mb_message, &mailBox_Buffer);
                
                /* Unlock RX message buffer and RX FIFO*/
                FLEXCAN_HAL_UnlockRxMsgBuff(base);
                  
                CallBack_fun.pEntry = CAN_TX_EventHandler;
                CallBack_fun.pValue = &mailBox_Buffer;
                
                /* Commented by Arvind*/
                /* Call function Rx/Tx Event handler */
                CallBack_fun.pEntry(CallBack_fun.pValue);  
                
            }
        }
    }

    /* Clear all other interrupts in ERRSTAT register (Error, Busoff, Wakeup) */
    FLEXCAN_HAL_ClearErrIntStatusFlag(base);
     
    return;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_DRV_GetTransmitStatus
 * Description   : This function returns whether the previous FLEXCAN receive is
 *                 completed.
 * When performing a non-blocking receive, the user can call this function to
 * ascertain the state of the current receive progress: in progress (or busy)
 * or complete (success).
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_DRV_GetTransmitStatus(uint32_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < CAN_INSTANCE_COUNT);
#endif
    flexcan_state_t * state = g_flexcanStatePtr[instance];

    return (state->isTxBusy ? FLEXCAN_STATUS_TX_BUSY : FLEXCAN_STATUS_SUCCESS);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_DRV_GetReceiveStatus
 * Description   : This function returns whether the previous FLEXCAN receive is
 *                 completed.
 * When performing a non-blocking receive, the user can call this function to
 * ascertain the state of the current receive progress: in progress (or busy)
 * or complete (success).
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_DRV_GetReceiveStatus(uint32_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < CAN_INSTANCE_COUNT);
#endif
    flexcan_state_t * state = g_flexcanStatePtr[instance];

    return (state->isRxBusy ? FLEXCAN_STATUS_RX_BUSY : FLEXCAN_STATUS_SUCCESS);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : FLEXCAN_DRV_AbortSendingData
 * Description   : This function ends a non-blocking FLEXCAN transmission early.
 * During a non-blocking FLEXCAN transmission, the user has the option to terminate
 * the transmission early if the transmission is still in progress.
 *
 *END**************************************************************************/
flexcan_status_t FLEXCAN_DRV_AbortSendingData(uint32_t instance)
{
#ifdef DEV_ERROR_DETECT
    DEV_ASSERT(instance < CAN_INSTANCE_COUNT);
#endif
    flexcan_state_t * state = g_flexcanStatePtr[instance];

    /* Check if a transfer is running. */
    if (!state->isTxBusy)
    {
        return FLEXCAN_STATUS_NO_TRANSMIT_IN_PROGRESS;
    }

